## Моето PB решение, в което въртя цикък по самата дума и буквите в нея. От там взимам буквата и я сравнявам в ASCII
## таблицата дали е главна буква. В същото време съм си създал и брояч, който на всяка интерация на цикъла се увеличава.
## Ако буквата е главна, добавям числото на брояча в списъка. Ако не е продължавам със следващата буква в цикъла.
# word = input()
# count = 0
# capital = []
# for letter in word:
#     if ord(letter) > 64 and ord(letter) < 91:
#         capital.append(count)
#     count += 1
# print(capital)


## Ново и по-умно решение използвайки фукцията на стринг .isupper() ,която автоматично проверява дали дадена буква е
# главна или не. И ако е, добавя индекса на буквата в списъка.
word = input()
capital = []

for letter in range(len(word)):
    char = word[letter]
    if char.isupper():
        capital.append(letter)
print(capital)
